In [792]:
import numpy as np
import pandas as pd

In [793]:
dict1={
    "name":['Harry', 'Rohan', 'Skillf', 'Shubh'],
    "marks":[92,34, 24, 17],
    "city":['Rampur','Kolkata', 'Bareilly', 'Antartica']
}

In [794]:
df=pd.DataFrame(dict1)

In [795]:
df

     name  marks       city
0   Harry     92     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [796]:
#to see the top most data
df.head(2)

    name  marks     city
0  Harry     92   Rampur
1  Rohan     34  Kolkata

In [797]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [798]:
#the numerical data are shown in details, like marks
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [799]:
#to convert into the csv file
df.to_csv('friends.csv')

In [800]:
#to hide the index
df.to_csv('friends_index_false.csv', index=False)

In [801]:
#to see the last most data
df.tail(1)

    name  marks       city
3  Shubh     17  Antartica

In [802]:
read=pd.read_csv('demo.csv')

In [803]:
read

     name  marks       city
0   Harry     92     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [804]:
# to read only the particular row like name, city etc
read['name']

0     Harry
1     Rohan
2    Skillf
3     Shubh
Name: name, dtype: object

In [805]:
# we even can read the data in the particular index like:

read['name'][0]

'Harry'

In [806]:
read['name'][0]='Harry'

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_12282/454520273.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read['name'][0]='Harry'

In [807]:
# even can change the data,
read['marks'][0]=99
# although it is showing the warning, but the code has been  updated!!

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_12282/2093934311.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  read['marks'][0]=99
/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_12282/2093934311.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read['marks'][0]=99

In [808]:
read

     name  marks       city
0   Harry     99     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [809]:
#to convert in to a csv file
read.to_csv('read1.csv', index=False)

In [810]:
#it also allow to custom index
read.index=['first', 'Second','Third', 'Fourt']

In [811]:
read

          name  marks       city
first    Harry     99     Rampur
Second   Rohan     34    Kolkata
Third   Skillf     24   Bareilly
Fourt    Shubh     17  Antartica

In [812]:
#creating a data frame in the form of row and columns
newdf =pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [813]:
#printning the data frame
newdf

            0         1         2         3         4
0    0.516479  0.936439  0.206818  0.370329  0.285466
1    0.380013  0.337850  0.583644  0.568847  0.543375
2    0.606532  0.870106  0.624090  0.694635  0.990961
3    0.132929  0.577489  0.276386  0.985330  0.378484
4    0.413104  0.350920  0.120739  0.179743  0.544417
..        ...       ...       ...       ...       ...
329  0.041954  0.729260  0.061666  0.500618  0.130436
330  0.455998  0.144522  0.583194  0.288248  0.305128
331  0.269463  0.432500  0.943502  0.858540  0.738120
332  0.633708  0.714800  0.636334  0.771367  0.915962
333  0.629863  0.049936  0.906106  0.979130  0.863788

[334 rows x 5 columns]

In [814]:
#to know the type 
type(newdf)

pandas.core.frame.DataFrame

In [815]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.519277    0.509205    0.493479    0.504230    0.513685
std      0.285164    0.275643    0.285684    0.281173    0.277909
min      0.004895    0.009630    0.007365    0.011900    0.001760
25%      0.279119    0.292519    0.242396    0.274182    0.297110
50%      0.541815    0.508719    0.479606    0.514980    0.516985
75%      0.762162    0.734993    0.737646    0.743147    0.747478
max      0.996059    0.999739    0.999972    0.999739    0.993923

In [816]:
#to get the info about the df
newdf.head()

          0         1         2         3         4
0  0.516479  0.936439  0.206818  0.370329  0.285466
1  0.380013  0.337850  0.583644  0.568847  0.543375
2  0.606532  0.870106  0.624090  0.694635  0.990961
3  0.132929  0.577489  0.276386  0.985330  0.378484
4  0.413104  0.350920  0.120739  0.179743  0.544417

In [817]:
#to know the data type
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [818]:
newdf[0][0]="Bishal Shah"

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_12282/674700252.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]="Bishal Shah"
/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_12282/674700252.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Bishal Shah' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="Bishal Shah"

In [819]:
newdf

               0         1         2         3         4
0    Bishal Shah  0.936439  0.206818  0.370329  0.285466
1       0.380013  0.337850  0.583644  0.568847  0.543375
2       0.606532  0.870106  0.624090  0.694635  0.990961
3       0.132929  0.577489  0.276386  0.985330  0.378484
4       0.413104  0.350920  0.120739  0.179743  0.544417
..           ...       ...       ...       ...       ...
329     0.041954  0.729260  0.061666  0.500618  0.130436
330     0.455998  0.144522  0.583194  0.288248  0.305128
331     0.269463  0.432500  0.943502  0.858540  0.738120
332     0.633708  0.714800  0.636334  0.771367  0.915962
333     0.629863  0.049936  0.906106  0.979130  0.863788

[334 rows x 5 columns]

In [820]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [821]:
#printing the index
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [822]:
#columns
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [823]:
#to convert into the numpy
newdf.to_numpy()

array([['Bishal Shah', 0.9364386958531207, 0.20681822617891932,
        0.37032879058394674, 0.28546552628167043],
       [0.38001349321086497, 0.3378499022958561, 0.583644403581453,
        0.568846786926376, 0.5433751728747686],
       [0.6065321622582339, 0.8701057980839682, 0.6240895424753231,
        0.6946348332980823, 0.9909605811652655],
       ...,
       [0.26946317207447346, 0.43250017618427616, 0.9435019688059745,
        0.8585400028930164, 0.7381201549625592],
       [0.633707870955792, 0.7148000284998515, 0.6363338031086391,
        0.7713669745211925, 0.9159622486240734],
       [0.6298634351785599, 0.04993557535328197, 0.9061058857392521,
        0.9791297288410403, 0.8637877456816889]],
      shape=(334, 5), dtype=object)

In [824]:
newdf[0][0]=np.random.rand()

In [825]:
newdf

            0         1         2         3         4
0    0.685717  0.936439  0.206818  0.370329  0.285466
1    0.380013  0.337850  0.583644  0.568847  0.543375
2    0.606532  0.870106  0.624090  0.694635  0.990961
3    0.132929  0.577489  0.276386  0.985330  0.378484
4    0.413104  0.350920  0.120739  0.179743  0.544417
..        ...       ...       ...       ...       ...
329  0.041954  0.729260  0.061666  0.500618  0.130436
330  0.455998  0.144522  0.583194  0.288248  0.305128
331  0.269463  0.432500  0.943502  0.858540  0.738120
332  0.633708  0.714800  0.636334  0.771367  0.915962
333  0.629863  0.049936  0.906106  0.979130  0.863788

[334 rows x 5 columns]

In [826]:
newdf.to_numpy()

array([[0.6857173518226322, 0.9364386958531207, 0.20681822617891932,
        0.37032879058394674, 0.28546552628167043],
       [0.38001349321086497, 0.3378499022958561, 0.583644403581453,
        0.568846786926376, 0.5433751728747686],
       [0.6065321622582339, 0.8701057980839682, 0.6240895424753231,
        0.6946348332980823, 0.9909605811652655],
       ...,
       [0.26946317207447346, 0.43250017618427616, 0.9435019688059745,
        0.8585400028930164, 0.7381201549625592],
       [0.633707870955792, 0.7148000284998515, 0.6363338031086391,
        0.7713669745211925, 0.9159622486240734],
       [0.6298634351785599, 0.04993557535328197, 0.9061058857392521,
        0.9791297288410403, 0.8637877456816889]],
      shape=(334, 5), dtype=object)

In [827]:
#to convert the row->column and the vice versa
#simply transpose
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.685717,0.380013,0.606532,0.132929,0.413104,0.158948,0.052687,0.627062,0.96007,0.33636,...,0.806535,0.097515,0.123675,0.928909,0.655058,0.041954,0.455998,0.269463,0.633708,0.629863
1,0.936439,0.33785,0.870106,0.577489,0.35092,0.902243,0.55012,0.643424,0.210899,0.0571,...,0.266259,0.50063,0.417208,0.802493,0.826402,0.72926,0.144522,0.4325,0.7148,0.049936
2,0.206818,0.583644,0.62409,0.276386,0.120739,0.719402,0.273638,0.01637,0.548328,0.18418,...,0.898459,0.805368,0.762304,0.109996,0.419198,0.061666,0.583194,0.943502,0.636334,0.906106
3,0.370329,0.568847,0.694635,0.98533,0.179743,0.137218,0.160396,0.88546,0.409789,0.726075,...,0.777259,0.663771,0.792893,0.895279,0.052256,0.500618,0.288248,0.85854,0.771367,0.97913
4,0.285466,0.543375,0.990961,0.378484,0.544417,0.683553,0.285934,0.329806,0.88325,0.109544,...,0.560153,0.237858,0.498109,0.61709,0.347444,0.130436,0.305128,0.73812,0.915962,0.863788

In [828]:
#to reverse sort the rows
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.629863  0.049936  0.906106  0.979130  0.863788
332  0.633708  0.714800  0.636334  0.771367  0.915962
331  0.269463  0.432500  0.943502  0.858540  0.738120
330  0.455998  0.144522  0.583194  0.288248  0.305128
329  0.041954  0.729260  0.061666  0.500618  0.130436
..        ...       ...       ...       ...       ...
4    0.413104  0.350920  0.120739  0.179743  0.544417
3    0.132929  0.577489  0.276386  0.985330  0.378484
2    0.606532  0.870106  0.624090  0.694635  0.990961
1    0.380013  0.337850  0.583644  0.568847  0.543375
0    0.685717  0.936439  0.206818  0.370329  0.285466

[334 rows x 5 columns]

In [829]:
#to reverse sort the columns
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.285466  0.370329  0.206818  0.936439  0.685717
1    0.543375  0.568847  0.583644  0.337850  0.380013
2    0.990961  0.694635  0.624090  0.870106  0.606532
3    0.378484  0.985330  0.276386  0.577489  0.132929
4    0.544417  0.179743  0.120739  0.350920  0.413104
..        ...       ...       ...       ...       ...
329  0.130436  0.500618  0.061666  0.729260  0.041954
330  0.305128  0.288248  0.583194  0.144522  0.455998
331  0.738120  0.858540  0.943502  0.432500  0.269463
332  0.915962  0.771367  0.636334  0.714800  0.633708
333  0.863788  0.979130  0.906106  0.049936  0.629863

[334 rows x 5 columns]

In [830]:
newdf

            0         1         2         3         4
0    0.685717  0.936439  0.206818  0.370329  0.285466
1    0.380013  0.337850  0.583644  0.568847  0.543375
2    0.606532  0.870106  0.624090  0.694635  0.990961
3    0.132929  0.577489  0.276386  0.985330  0.378484
4    0.413104  0.350920  0.120739  0.179743  0.544417
..        ...       ...       ...       ...       ...
329  0.041954  0.729260  0.061666  0.500618  0.130436
330  0.455998  0.144522  0.583194  0.288248  0.305128
331  0.269463  0.432500  0.943502  0.858540  0.738120
332  0.633708  0.714800  0.636334  0.771367  0.915962
333  0.629863  0.049936  0.906106  0.979130  0.863788

[334 rows x 5 columns]

In [831]:
#to access all the elements at 0th column
newdf[0]

0      0.685717
1      0.380013
2      0.606532
3      0.132929
4      0.413104
         ...
329    0.041954
330    0.455998
331    0.269463
332    0.633708
333    0.629863
Name: 0, Length: 334, dtype: object

In [832]:
#inorder to remove the warning, we use .lock[0][0] for the replacement of the value
newdf.loc[0,0]=11

In [833]:
newdf.head()

          0         1         2         3         4
0        11  0.936439  0.206818  0.370329  0.285466
1  0.380013  0.337850  0.583644  0.568847  0.543375
2  0.606532  0.870106  0.624090  0.694635  0.990961
3  0.132929  0.577489  0.276386  0.985330  0.378484
4  0.413104  0.350920  0.120739  0.179743  0.544417

In [834]:
#to set the columns name
newdf.columns=list("Abcde")

In [835]:
newdf

            A         b         c         d         e
0          11  0.936439  0.206818  0.370329  0.285466
1    0.380013  0.337850  0.583644  0.568847  0.543375
2    0.606532  0.870106  0.624090  0.694635  0.990961
3    0.132929  0.577489  0.276386  0.985330  0.378484
4    0.413104  0.350920  0.120739  0.179743  0.544417
..        ...       ...       ...       ...       ...
329  0.041954  0.729260  0.061666  0.500618  0.130436
330  0.455998  0.144522  0.583194  0.288248  0.305128
331  0.269463  0.432500  0.943502  0.858540  0.738120
332  0.633708  0.714800  0.636334  0.771367  0.915962
333  0.629863  0.049936  0.906106  0.979130  0.863788

[334 rows x 5 columns]

In [836]:
#so now if we want to access 11, we need to [0,'A']

In [837]:
newdf

            A         b         c         d         e
0          11  0.936439  0.206818  0.370329  0.285466
1    0.380013  0.337850  0.583644  0.568847  0.543375
2    0.606532  0.870106  0.624090  0.694635  0.990961
3    0.132929  0.577489  0.276386  0.985330  0.378484
4    0.413104  0.350920  0.120739  0.179743  0.544417
..        ...       ...       ...       ...       ...
329  0.041954  0.729260  0.061666  0.500618  0.130436
330  0.455998  0.144522  0.583194  0.288248  0.305128
331  0.269463  0.432500  0.943502  0.858540  0.738120
332  0.633708  0.714800  0.636334  0.771367  0.915962
333  0.629863  0.049936  0.906106  0.979130  0.863788

[334 rows x 5 columns]

In [838]:
#to remove the last column
newdf.drop(0,axis=0)

            A         b         c         d         e
1    0.380013  0.337850  0.583644  0.568847  0.543375
2    0.606532  0.870106  0.624090  0.694635  0.990961
3    0.132929  0.577489  0.276386  0.985330  0.378484
4    0.413104  0.350920  0.120739  0.179743  0.544417
5    0.158948  0.902243  0.719402  0.137218  0.683553
..        ...       ...       ...       ...       ...
329  0.041954  0.729260  0.061666  0.500618  0.130436
330  0.455998  0.144522  0.583194  0.288248  0.305128
331  0.269463  0.432500  0.943502  0.858540  0.738120
332  0.633708  0.714800  0.636334  0.771367  0.915962
333  0.629863  0.049936  0.906106  0.979130  0.863788

[333 rows x 5 columns]

In [839]:
newdf.loc[0,'A']=90

In [840]:
newdf

            A         b         c         d         e
0          90  0.936439  0.206818  0.370329  0.285466
1    0.380013  0.337850  0.583644  0.568847  0.543375
2    0.606532  0.870106  0.624090  0.694635  0.990961
3    0.132929  0.577489  0.276386  0.985330  0.378484
4    0.413104  0.350920  0.120739  0.179743  0.544417
..        ...       ...       ...       ...       ...
329  0.041954  0.729260  0.061666  0.500618  0.130436
330  0.455998  0.144522  0.583194  0.288248  0.305128
331  0.269463  0.432500  0.943502  0.858540  0.738120
332  0.633708  0.714800  0.636334  0.771367  0.915962
333  0.629863  0.049936  0.906106  0.979130  0.863788

[334 rows x 5 columns]

In [845]:
newdf.loc[0,'b']=901

In [846]:
newdf

            A           b         c         d         e      B
0          90  901.000000  0.206818  0.370329  0.285466  901.0
1    0.380013    0.337850  0.583644  0.568847  0.543375    NaN
2    0.606532    0.870106  0.624090  0.694635  0.990961    NaN
3    0.132929    0.577489  0.276386  0.985330  0.378484    NaN
4    0.413104    0.350920  0.120739  0.179743  0.544417    NaN
..        ...         ...       ...       ...       ...    ...
329  0.041954    0.729260  0.061666  0.500618  0.130436    NaN
330  0.455998    0.144522  0.583194  0.288248  0.305128    NaN
331  0.269463    0.432500  0.943502  0.858540  0.738120    NaN
332  0.633708    0.714800  0.636334  0.771367  0.915962    NaN
333  0.629863    0.049936  0.906106  0.979130  0.863788    NaN

[334 rows x 6 columns]

In [851]:
newdf.head()

          A           b         c         d         e      B
0        90  901.000000  0.206818  0.370329  0.285466  901.0
1  0.380013    0.337850  0.583644  0.568847  0.543375    NaN
2  0.606532    0.870106  0.624090  0.694635  0.990961    NaN
3  0.132929    0.577489  0.276386  0.985330  0.378484    NaN
4  0.413104    0.350920  0.120739  0.179743  0.544417    NaN

In [863]:
newdf.drop(1, axis=0)#removed the data of  1st row

            A           b         c         d         e      B
0          90  901.000000  0.206818  0.370329  0.285466  901.0
2    0.606532    0.870106  0.624090  0.694635  0.990961    NaN
3    0.132929    0.577489  0.276386  0.985330  0.378484    NaN
4    0.413104    0.350920  0.120739  0.179743  0.544417    NaN
5    0.158948    0.902243  0.719402  0.137218  0.683553    NaN
..        ...         ...       ...       ...       ...    ...
329  0.041954    0.729260  0.061666  0.500618  0.130436    NaN
330  0.455998    0.144522  0.583194  0.288248  0.305128    NaN
331  0.269463    0.432500  0.943502  0.858540  0.738120    NaN
332  0.633708    0.714800  0.636334  0.771367  0.915962    NaN
333  0.629863    0.049936  0.906106  0.979130  0.863788    NaN

[333 rows x 6 columns]

In [865]:
newdf.drop(3,axis=0)#removed the data of  3rd  row

            A           b         c         d         e      B
0          90  901.000000  0.206818  0.370329  0.285466  901.0
1    0.380013    0.337850  0.583644  0.568847  0.543375    NaN
2    0.606532    0.870106  0.624090  0.694635  0.990961    NaN
4    0.413104    0.350920  0.120739  0.179743  0.544417    NaN
5    0.158948    0.902243  0.719402  0.137218  0.683553    NaN
..        ...         ...       ...       ...       ...    ...
329  0.041954    0.729260  0.061666  0.500618  0.130436    NaN
330  0.455998    0.144522  0.583194  0.288248  0.305128    NaN
331  0.269463    0.432500  0.943502  0.858540  0.738120    NaN
332  0.633708    0.714800  0.636334  0.771367  0.915962    NaN
333  0.629863    0.049936  0.906106  0.979130  0.863788    NaN

[333 rows x 6 columns]

In [878]:
newdf3=newdf.drop('B', axis=1) #column B is removed
newdf3

            A           b         c         d         e
0          90  901.000000  0.206818  0.370329  0.285466
1    0.380013    0.337850  0.583644  0.568847  0.543375
2    0.606532    0.870106  0.624090  0.694635  0.990961
3    0.132929    0.577489  0.276386  0.985330  0.378484
4    0.413104    0.350920  0.120739  0.179743  0.544417
..        ...         ...       ...       ...       ...
329  0.041954    0.729260  0.061666  0.500618  0.130436
330  0.455998    0.144522  0.583194  0.288248  0.305128
331  0.269463    0.432500  0.943502  0.858540  0.738120
332  0.633708    0.714800  0.636334  0.771367  0.915962
333  0.629863    0.049936  0.906106  0.979130  0.863788

[334 rows x 5 columns]

In [877]:
newdf.drop('d', axis=1)#the axis=1 denotes column and 0 denotes row

            A           b         c         e      B
0          90  901.000000  0.206818  0.285466  901.0
1    0.380013    0.337850  0.583644  0.543375    NaN
2    0.606532    0.870106  0.624090  0.990961    NaN
3    0.132929    0.577489  0.276386  0.378484    NaN
4    0.413104    0.350920  0.120739  0.544417    NaN
..        ...         ...       ...       ...    ...
329  0.041954    0.729260  0.061666  0.130436    NaN
330  0.455998    0.144522  0.583194  0.305128    NaN
331  0.269463    0.432500  0.943502  0.738120    NaN
332  0.633708    0.714800  0.636334  0.915962    NaN
333  0.629863    0.049936  0.906106  0.863788    NaN

[334 rows x 5 columns]